app/controllers/application_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def load_cart
      @cart = Product.find(session[:cart])