app/controllers/checkout_controller.rb

    def create
      if current_employee.amount == nil
        current_employee.amount = 0
      end
      session[:cart].each do |n|
          current_employee.amount -= Product.find(n).price
          current_employee.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "products" SET "updated_at" = ?, "count" = ? WHERE "products"."id" = ?  [["updated_at", "2023-04-18 08:16:10.972854"], ["count", 1], ["id", 1]]