app/controllers/gcards_controller.rb

  def index
    @gcards = Gcard.all
---
SELECT "gcards".* FROM "gcards"

  def create
    @gcard = Gcard.new(gcard_params)
    # @gcard.user_id = current_user.id
    if !Employee.find_by(email:@gcard.email)
      emp = Employee.create(email: @gcard.email, password:"12345678", password_confirmation:"12345678")
      emp.save
    else
      emp = Employee.find_by(email:@gcard.email)
    end
    @gcard = Gcard.new(gcard_params.merge!(user: current_user, employee: emp))
    @gcard.code = SecureRandom.alphanumeric(50)

    respond_to do |format|
      if @gcard.save
        if current_user.amount >= @gcard.amount
          current_user.amount = current_user.amount - @gcard.amount
          current_user.save
          format.html { redirect_to gcard_url(@gcard), notice: "Gcard was successfully created." }
          format.json { render :show, status: :created, location: @gcard }
          # flash.alert = "Article was created successfully."
          # redirect_to @gcard
        else
          @gcard.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."email" = ? LIMIT ?  [["email", "20test@gmail.com"], ["LIMIT", 1]]
INSERT INTO "employees" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "name", "amount") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "gcards" ("code", "amount", "email", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "gcards" ("code", "amount", "email", "description", "created_at", "updated_at", "user_id", "employee_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "amount" = ? WHERE "users"."id" = ?  [["updated_at", "2023-04-15 08:08:16.187735"], ["amount", 1400], ["id", 1]]
DELETE FROM "gcards" WHERE "gcards"."id" = ?  [["id", 1]]

  def destroy
    @gcard.destroy
---
DELETE FROM "gcards" WHERE "gcards"."id" = ?  [["id", 4]]

    def set_gcard
      @gcard = Gcard.find(params[:id])
---
SELECT "gcards".* FROM "gcards" WHERE "gcards"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]