app/controllers/gcards_controller.rb

SELECT "gcards".* FROM "gcards" WHERE "gcards"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_gcard
      @gcard = Gcard.find(params[:id])