app/controllers/products_controller.rb

INSERT INTO "products" ("name", "price", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?, ?)  [["name", "Phone"], ["price", 100], ["created_at", "2023-04-18 06:18:26.359331"], ["updated_at", "2023-04-18 06:18:26.359331"], ["description", nil]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

DELETE FROM "products" WHERE "products"."id" = ?  [["id", 1]]
---
  def destroy
    @product.destroy

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_product
      @product = Product.find(params[:id])