app/views/gcards/_gcard.html.erb

            <p>Description : <span class="has-text-weight-bold"> <%= gcard.description %></span></p>
            <p class="italic">Sent <%= time_ago_in_words (gcard.created_at) %> ago</p>
---
INSERT INTO "gcards" ("code", "amount", "email", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)