app/views/gcards/index.html.erb

  <div id="gcards">
    <% (current_user.gcards).each do |gcard| %>
---
SELECT "gcards".* FROM "gcards" WHERE "gcards"."user_id" = ?  [["user_id", 1]]

  <div id="gcards">
    <% (current_employee.gcards).each do |gcard| %>
---
SELECT "gcards".* FROM "gcards" WHERE "gcards"."employee_id" = ?  [["employee_id", 2]]